[{
    "description": "This is the initial trello page when an account has been created.",
    "image": "Screenshot 2015-10-26 13.47.02.png"
},
{
    "description": " The main boards page. Will show a list of boards that have been created by the user and options below to either create a new board, keeping the menu open, or see all the closed boards.",
    "image": "Screenshot 2015-10-26 13.47.19.png"
},
{
    "description": "When the user would like to create a new board, selecting the create new boards link, will provide this menu option. Here you can place the name of the new board you wish to create. Also, whether you would like for it to be private or not. After selecting a title, then select create.",
    "image": "Screenshot 2015-10-26 14.05.37.png"
},
{
    "description": "Once the board has been created, this is the available menu. It will show the title of the board created and allow for input of lists. After entering a list title, click save.",
    "image": "Screenshot 2015-10-26 14.05.47.png"
},
{
    "description": "The left side of the image is a created list. The right side is the same menu as before that allows for more lists to be created.",
    "image": "Screenshot 2015-10-26 14.06.03.png"
},
{
    "description": "This shows the ability to create a new card. Cards are the reminders or lists within the category iteself. After writing in the card title, click add.",
    "image": "Screenshot 2015-10-26 14.06.41.png"
},
{
	"description": "After the card is created, this is the viewer window when clicking the pencil or edit to the right of the card. These are the full details within the card. You can add notes, edit the descriptions, and see the activity log of this card.",
	"image": "Screenshot 2015-10-26 14.06.53.png"
},
{
    "description": "To the right of the card details is this menu of options. By selecting them, the user can ensure further details on the card.",
    "image": "Screenshot 2015-10-26 14.58.10.png"
},
{
	"description": "The menu option to add members to this card.",
	"image": "Screenshot 2015-10-26 14.58.28.png"
},
{
	"description": "The menu to color code the labels for coordination of the cards. By selecting the edit button on the right of the color block, allows the users to change those colors.",
	"image": "Screenshot 2015-10-26 14.58.40.png"
},
{
	"description": "This menu is a checklist option.",
	"image": "Screenshot 2015-10-26 14.58.57.png"
},
{
	"description": "This menu is for if a particular card has a due date and time that can be set.",
	"image": "Screenshot 2015-10-26 14.58.57.png"
},
{
	"description": "This menu is selected if the user request to attach a file or link to the card.",
	"image": "Screenshot 2015-10-26 14.59.12.png"
},
{
	"description": "The second half is the actions section. This menu is selected is the card needs to be moved to a different board or list.",
	"image": "Screenshot 2015-10-26 14.59.21.png"
},
{
	"description": "This menu is selected if the user would like to copy a card. Though its copied, it can still have a name change. It can also be placed onto a different board or list. Within the list, the position can be selected.",
	"image": "Screenshot 2015-10-26 14.59.32.png"
},
{
	"description": "This menu is for the ability to share the card or adding a link to the card. This card can be emailed to other members as well.",
	"image": "Screenshot 2015-10-26 15.00.00.png"
},
{
	"description": "On the right side of the main user page is a Menu section. Within this section allows the user to Add members to the trello board, changing the main background, filter out the cards, upload power-ups, and has an activity monitor of the usage.",
	"image": "Screenshot 2015-10-26 15.15.45.png"
},
{
	"description": "This menu allows the user to add group members by adding the user names in the search box.",
	"image": "Screenshot 2015-10-26 15.16.41.png"
},
{
	"description": "The user can change the background to user preference to other solid colors or images if the user is under the Trello Gold or Business Class.",
	"image":"Screenshot 2015-10-26 15.16.51.png"
},
{
	"description": "This menu allows for creating and changing the colors of the labels for the filter cards. Then the user can select and due date.",
	"image":"Screenshot 2015-10-26 15.17.00.png"
},
{
	"description": "The power-ups are explained in the images shown below. The are additional functionality and attributes to the menus or cards. ",
	"image": "Screenshot 2015-10-26 15.17.12.png"
},
{
	"description": "These are a few examples of the possible free power-ups. The user can place aging attributes to the card when the due date has passed for the particular activity.",
	"image": "Screenshot 2015-10-26 15.17.32.png"
},
{
	"description": "Also, is the ability to enable a calendar that will allow for accessing the trello in a calendar view rather than a column list view.",
	"image": "Screenshot 2015-10-26 15.17.40.png"
},
{
	"description": "This option enables the ability for users to vote on the cards, that can be accessed later. It will show a list of the number of users and how many votes for each of the cards.",
	"image": "Screenshot 2015-10-26 15.17.48.png"
},
{
	"description": "The last menu option on the first screen is the More tab. This provides the ability to reach settings, stickers, labels, archived items, and others that are described below.",
	"image": "Screenshot 2015-10-26 15.36.15.png"
},
{
	"description": "The permissions of the cards, the page, and the members can be changed within the settings. The main user can allow team members to join a particular board without being invited if the permissions are set accordingly.",
	"image": "Screenshot 2015-10-26 15.36.26.png"
},
{
	"description": "If the user desires, stickers can be added. The stickers allow for a visual flair to the cards that can assist with communicating the card status.",
	"image": "Screenshot 2015-10-26 15.36.34.png"
},
{
	"description": "The cards can be archived when the user doesn't want them on the screen. Under this menu, the archived cards can be found in this list and viewed.",
	"image": "Screenshot 2015-10-26 15.36.45.png"
},
{
	"description": "The user can email the boards to others under the email to board section under settings.",
	"image": "Screenshot 2015-10-26 15.36.54.png"
},
{
	"description": "In this section, the user can copy the boards as well and can be selected for private.",
	"image": "Screenshot 2015-10-26 15.37.04.png"
},
{
	"description": "The cards can be printed and exported.",
	"image": "Screenshot 2015-10-26 15.37.10.png"
},
{
	"description": "The description on how boards can be closed from this menu.",
	"image": "Screenshot 2015-10-26 15.37.16.png"
},
{
	"description": "There are multiple areas for linking, but this is one menu section that allows for the link to this board to be placed.",
	"image": "Screenshot 2015-10-26 15.37.21.png"
},
{
	"description": "By selecting the + sign option to the top right of the main page, allows the users to access the ability to create a board and to create personal or business teams.",
	"image": "Screenshot 2015-10-26 15.57.31.png"
},
{
	"description": "To access personal user setting, the user name at the top of the screen can be selected. This shows help options, shortcuts, getting started guides, settings, and further details of using Trello.",
	"image": "Screenshot 2015-10-26 15.57.49.png"
},
{
	"description": "Next to the board title, the privacy settings can be accessed by selecting the tab Private. This will allow the user to select private or public.",
	"image": "Screenshot 2015-10-26 15.58.11.png"
},
{
	"description": "Next to the user name is the bell symbol that is for the notifications to be listed when changes occur to the cards or boards.",
	"image": "Screenshot 2015-10-26 16.05.14.png"
}]