[{
    "description": "This is the initial trello page when an account has been created.",
    "image": "Screenshot 2015-10-26 13.47.02.png"
},
{
    "description": " The main boards page. Will show a list of boards that have been created by the user and options below to either create a new board, keeping the menu open, or see all the closed boards.",
    "image": "Screenshot 2015-10-26 13.47.19.png"
},
{
    "description": "When the user would like to create a new board, selecting the create new boards link, will provide this menu option. Here you can place the name of the new board you wish to create. Also, whether you would like for it to be private or not. After selecting a title, then select create.",
    "image": "Screenshot 2015-10-26 14.05.37.png"
},
{
    "description": "Once the board has been created, this is the available menu. It will show the title of the board created and allow for input of lists. After entering a list title, click save.",
    "image": "Screenshot 2015-10-26 14.05.47.png"
},
{
    "description": "The left side of the image is a created list. The right side is the same menu as before that allows for more lists to be created.",
    "image": "Screenshot 2015-10-26 14.06.03.png"
},
{
    "description": "This shows the ability to create a new card. Cards are the reminders or lists within the category iteself. After writing in the card title, click add.",
    "image": "Screenshot 2015-10-26 14.06.41.png"
},
{
	"description": "After the card is created, this is the viewer window when clicking the pencil or edit to the right of the card. These are the full details within the card. You can add notes, edit the descriptions, and see the activity log of this card.",
	"image": "Screenshot 2015-10-26 14.06.53.png"
},
{
    "description": "To the right of the card details is this menu of options. By selecting them, the user can ensure further details on the card.",
    "image": "Screenshot 2015-10-26 14.58.10.png"
},
{
	"description": "The menu option to add members to this card.",
	"image": "Screenshot 2015-10-26 14.58.28.png"
},
{
	"description": "The menu to color code the labels for coordination of the cards. By selecting the edit button on the right of the color block, allows the users to change those colors.",
	"image": "Screenshot 2015-10-26 14.58.40.png"
},
{
	"description": "This menu is a checklist option.",
	"image": "Screenshot 2015-10-26 14.58.57.png"
},
{
	"description": "This menu is for if a particular card has a due date and time that can be set.",
	"image": "Screenshot 2015-10-26 14.58.57.png"
},
{
	"description": "This menu is selected if the user request to attach a file or link to the card.",
	"image": "Screenshot 2015-10-26 14.59.12.png"
},
{
	"description": "The second half is the actions section. This menu is selected is the card needs to be moved to a different board or list.",
	"image": "Screenshot 2015-10-26 14.59.21.png"
},
{
	"description": "This menu is selected if the user would like to copy a card. Though its copied, it can still have a name change. It can also be placed onto a different board or list. Within the list, the position can be selected.",
	"image": "Screenshot 2015-10-26 14.59.32.png"
},
{
	"description": "This menu is for the ability to share the card or adding a link to the card. This card can be emailed to other members as well.",
	"image": "Screenshot 2015-10-26 15.00.00.png"
},
{
	"description": "Since the stage window is only -240 x 240 for a size on the x-axis, we will set the value to be -280, so that the cloud will go off the window. But the entire cloud is unable to disappear, so we will add a 'hide' block to make the sprite disappear once its x position is less that -280.",
	"image": "Cloud1Hide.PNG"
},
{
	"description": "Ultimately, we will have a second cloud sprite that will be moving across the top of the window, that's why we want this cloud sprite to stay hidden for a short period of time as the other one travels across the screen. This will give the impression of the cat moving slowly. We grab the 'wait [] secs' block from the control category and change the time to 14.",
	"image": "Cloud1Wait.PNG"
},
{
	"description": "After waiting, we want the cloud sprite to appear again, so we grab the 'show' block from the looks category and add it to the stack, inside the 'if' block.",
	"image":"Cloud1Show.PNG"
},
{
	"description": "The cloud sprite needs to be reset to the other side of the window, so we grab the 'set x to []' block from the motion category and add it as the last block in the 'if' block. Then we add the value 300 to the same block so that the cloud sprite starts off the window.",
	"image":"Cloud1SetX.PNG"
},
{
	"description": "Now this cloud sprite's script is complete",
	"image": "Cloud1Script.PNG"
},
{
	"description": "But we want another cloud sprite to be moving the exact same as the first. This is where we will use the duplicate tool at the top of the screen. We will hit that icon click the cloud sprite in the Sprite area.",
	"image": "CloudDuplicate.PNG"
},
{
	"description": "When we select cloud2, we see that it has the exact same script as the first cloud. The duplicate tool copied everything over.",
	"image": "Cloud2.PNG"
},
{
	"description": "We will move the clouds around to be placed where we want them to start once the scripts start to run.",
	"image": "CloudsPlacement.PNG"
},
{
	"description": "Next, we need a background. So we select the backdrop found in the Sprite area. Notice how the Costume tab has now changed to say 'Backdrop'.",
	"image": "Backdrop.PNG"
},
{
	"description": "We'll add a gradiant blue color to the backdrop by selecting the paint can (to fill), the gradiant option (to style), and the blue color from the palette.",
	"image": "BackdropColor.PNG"
},
{
	"description": "We need a ground for the cat sprite to walk on, so we will use the rectangle tool, with the solid box option, and the redish brown color from the palette, and select a rectangled area toward the bottom of the backdrop.",
	"image": "BackdropGroundSelect.PNG"
},
{
	"description": "Once created, an option is available to move the rectangle around, rotate it, or even resize it. But we don't want to do any of that, so we will select off the backdrop.",
	"image": "BackdropGroundSet.PNG"
},
{
	"description": "Final step, we click and hold the cat sprite and move it to be over the ground. The scripts for all the sprites are done and the background is set. The Scratch program is complete and ready to be run. Move the cursor into the stage area and press the right arrow key to see the program run.",
	"image": "CatPlacement.PNG"
}]